In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
box_path = "\\Users\\User\\Dropbox\\"

#year = 2022
name = 'STA'
#buy_date = '2021-06-15' # oldest active record

In [2]:
format_dict = {'qty':'{:,}',
              'sell_price':'{:,.2f}','buy_price':'{:,.2f}','diff':'{:,.2f}',
              'sell_amt':'{:,.2f}','buy_amt':'{:,.2f}','gross':'{:,.2f}','profit':'{:,.2f}',
              'pct':'{:,.2f}%','net':'{:,.2f}',
              'cost_amt':'{:,.2f}','unit_cost':'{:,.2f}','avg_cost':'{:,.2f}'}

pd.set_option('display.float_format','{:,.2f}'.format)

### Record selection for active stocks

In [3]:
sql = '''
SELECT name, buys.date AS buy_date,
buys.price AS unit_cost, qty, 
(buys.price * qty) AS cost_amt, net
FROM buys
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s' AND status = 'Active'
ORDER BY buys.date DESC'''
sql = sql % name
print(sql)

buys_df = pd.read_sql(sql, conpf)
buys_df.style.format(format_dict)

SELECT name, buys.date AS buy_date,
buys.price AS unit_cost, qty,
(buys.price * qty) AS cost_amt, net
FROM buys
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = 'STA' AND status = 'Active'
ORDER BY buys.date DESC

In [4]:
buys_df[['cost_amt','net','qty']].sum()

cost_amt   759,375.00
net        761,056.95
qty         22,500.00
dtype: float64

In [5]:
qty = 22500
net_cost = 761056
net_cost, qty

(761056, 22500)

### Record selection for sold stocks

In [6]:
sql = '''
SELECT name, YEAR(sells.date) AS sell_year, MONTH(sells.date) AS sell_month,  
             YEAR(buys.date) AS buy_year, MONTH(buys.date) AS buy_month,
sells.price AS sell_price, buys.price AS buy_price, 
(sells.price - buys.price) AS diff, qty, 
(sells.price * qty) AS sell_amt,
(buys.price * qty) AS buy_amt,
(sells.price - buys.price) * qty AS gross, 
ROUND((sells.price - buys.price)/buys.price*100,2) AS pct, profit, buys.kind
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s' 
ORDER BY sell_year DESC, sell_month DESC, name'''

sql = sql % (name)
sells_df = pd.read_sql(sql, conpf)
print(sql)
sells_df

SELECT name, YEAR(sells.date) AS sell_year, MONTH(sells.date) AS sell_month,
             YEAR(buys.date) AS buy_year, MONTH(buys.date) AS buy_month,
sells.price AS sell_price, buys.price AS buy_price,
(sells.price - buys.price) AS diff, qty,
(sells.price * qty) AS sell_amt,
(buys.price * qty) AS buy_amt,
(sells.price - buys.price) * qty AS gross,
ROUND((sells.price - buys.price)/buys.price*100,2) AS pct, profit, buys.kind
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = 'STA'
ORDER BY sell_year DESC, sell_month DESC, name

,name,sell_year,sell_month,buy_year,buy_month,sell_price,buy_price,diff,qty,sell_amt,buy_amt,gross,pct,profit,kind
0,STA,2022,6,2022,5,22.20,21.80,0.40,1500,"33,300.00","32,700.00",600.00,1.83,453.81,HD
1,STA,2021,2,2021,1,44.50,30.00,14.50,2000,"89,000.00","60,000.00","29,000.00",48.33,"28,669.98",DTD
2,STA,2021,2,2021,1,45.50,30.00,15.50,2000,"91,000.00","60,000.00","31,000.00",51.67,"30,665.55",DTD
3,STA,2021,2,2021,1,50.50,30.00,20.50,2000,"101,000.00","60,000.00","41,000.00",68.33,"40,643.41",DTD
4,STA,2020,9,2020,8,27.50,26.00,1.50,8000,"220,000.00","208,000.00","12,000.00",5.77,"11,052.02",DTD
5,STA,2020,8,2020,7,27.50,24.90,2.60,8000,"220,000.00","199,200.00","20,800.00",10.44,"19,871.52",DTD

In [7]:
sells_df[['gross','profit','qty']].sum()

gross    134,400.00
profit   131,356.29
qty       23,500.00
dtype: float64

In [8]:
profit = 131_356

### Record selection for dividends

In [9]:
sql = '''
SELECT name, p_date, amt, net, amt-net AS refund,
year, quarter AS q, x_date, number, ppu, (net / number * 1000) AS div_1k
FROM dividends
WHERE name = '%s' 
ORDER BY p_date DESC'''
sql = sql % (name)
print(sql)

div_df = pd.read_sql(sql, conpf)
div_df

SELECT name, p_date, amt, net, amt-net AS refund,
year, quarter AS q, x_date, number, ppu, (net / number * 1000) AS div_1k
FROM dividends
WHERE name = 'STA'
ORDER BY p_date DESC

,name,p_date,amt,net,refund,year,q,x_date,number,ppu,div_1k
0,STA,2022-09-08,"22,500.00","20,587.50","1,912.50",2022,2,2022-08-23,22500,1.00,915.00
1,STA,2022-05-06,"14,625.00","13,387.50","1,237.50",2021,4,2022-04-19,22500,0.65,595.00
2,STA,2021-12-08,"18,750.00","16,875.00","1,875.00",2021,3,2021-11-19,15000,1.25,"1,125.00"
3,STA,2021-09-08,"9,375.00","8,625.00",750.00,2021,2,2021-08-23,7500,1.25,"1,150.00"

In [10]:
div_grp = div_df.groupby(['name'], as_index=True).agg(
    {
        'amt':['sum'],
        'net':['sum'], 
        'number':['mean','count'],         
    }
)
div_grp

           amt       net    number
           sum       sum      mean count
name
STA  65,250.00 59,475.00 16,875.00     4

In [11]:
acc_div = 59_475
acc_div

59475

In [12]:
sell_amt = net_cost - acc_div - profit
sell_amt

570225

In [13]:
sell_price = sell_amt / qty
sell_price

25.343333333333334

In [14]:
sell_price = 25.25 # + unit_plus
sales_amt = sell_price * qty
sales_amt

568125.0

### Plan A: Sell at 25.25 x 22,500 shares